research/visualization_methods/outputs/Simple Nonlinear Node__nonlinear_estimation/nonlinear_estimation.dot
digraph G {
  "Gamma" [label="Gamma"];
  "NonlinearNode" [label="NonlinearNode"];
  "Normal" [label="Normal"];
  "NormalMeanPrecision" [label="NormalMeanPrecision"];
  "PosteriorforθlabelEstimatedlegendbottomrightfilltruefillopacity02xlim" [label="PosteriorforθlabelEstimatedlegendbottomrightfilltruefillopacity02xlim"];
  "StableRNG" [label="StableRNG"];
  "abs" [label="abs"];
  "constraints" [label="constraints"];
  "data" [label="data"];
  "estimated" [label="estimated"];
  "initialization" [label="initialization"];
  "m" [label="m"];
  "m_μ" [label="m_μ"];
  "m_σ" [label="m_σ"];
  "mean" [label="mean"];
  "meta" [label="meta"];
  "model" [label="model"];
  "nconstsraints" [label="nconstsraints"];
  "ninit" [label="ninit"];
  "nmeta" [label="nmeta"];
  "nonlinear_estimation" [label="nonlinear_estimation"];
  "nonlinear_fn" [label="nonlinear_fn"];
  "nonlinear_fn(x)" [label="nonlinear_fn(x)"];
  "nsamples" [label="nsamples"];
  "plot(estimated, title" [label="plot(estimated, title"];
  "precision" [label="precision"];
  "q" [label="q"];
  "q(m)" [label="q(m)"];
  "q(w)" [label="q(w)"];
  "q(θ, w, m)" [label="q(θ, w, m)"];
  "rand" [label="rand"];
  "rng" [label="rng"];
  "seed" [label="seed"];
  "vague" [label="vague"];
  "variance" [label="variance"];
  "w" [label="w"];
  "y" [label="y"];
  "ylim" [label="ylim"];
  "θ" [label="θ"];
  "θ_μ" [label="θ_μ"];
  "θ_σ" [label="θ_σ"];
  "Gamma" -> "q(w)";
  "NonlinearNode" -> "w";
  "Normal" -> "estimated";
  "Normal" -> "m";
  "Normal" -> "y";
  "Normal" -> "θ";
  "NormalMeanPrecision" -> "q(m)";
  "PosteriorforθlabelEstimatedlegendbottomrightfilltruefillopacity02xlim" -> "plot(estimated, title";
  "StableRNG" -> "rng";
  "abs" -> "nonlinear_fn(x)";
  "m" -> "y";
  "m_μ" -> "m";
  "m_μ" -> "model";
  "m_σ" -> "m";
  "mean" -> "m";
  "mean" -> "y";
  "mean" -> "θ";
  "nconstsraints" -> "constraints";
  "ninit" -> "initialization";
  "nmeta" -> "meta";
  "nonlinear_estimation" -> "model";
  "nonlinear_fn" -> "meta";
  "nonlinear_fn" -> "w";
  "nsamples" -> "constraints";
  "nsamples" -> "meta";
  "precision" -> "y";
  "q" -> "q(θ, w, m)";
  "rand" -> "data";
  "rng" -> "data";
  "seed" -> "rng";
  "vague" -> "q(m)";
  "vague" -> "q(w)";
  "variance" -> "m";
  "variance" -> "θ";
  "w" -> "data";
  "w" -> "y";
  "ylim" -> "plot(estimated, title";
  "θ" -> "w";
  "θ_μ" -> "model";
  "θ_μ" -> "θ";
  "θ_σ" -> "θ";
}
